<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a089068dda9293366f212a15f46b56770de05823bd6d3f743534a351af61b9d3","plan_job_ref":"Job Plan Airflow DAGs #396 at https://github.com/cal-itp/data-infra/actions/runs/16534036726","plan_out_hash":"ca8adc4606d8c189840f3ec00572666e9683e30d7ea7ffb7648967ca6edc64dd","plan_hash":"9d5290938b67aa44ef1b15fa0048f966fd633876d489257cde8725a4ae55ac91","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 9 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ds7XfQ==" -> (known after apply)
!~      detect_md5hash      = "iCoCoLWAEVeIR7vod1gVPg==" -> "different hash"
!~      generation          = 1753403634008980 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "iCoCoLWAEVeIR7vod1gVPg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/.DS_Store"] will be destroyed
  # (because key ["macros/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1753403633068027 -> null
-       id                  = "calitp-staging-composer-data/warehouse/macros/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.DS_Store?generation=1753403633068027&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/macros/.DS_Store" -> null
-       output_name         = "data/warehouse/macros/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmacros%2F.DS_Store" -> null
-       source              = "../../../../warehouse/macros/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YMHdGA==" -> (known after apply)
!~      detect_md5hash      = "hpbmvkOQUTAs6tg4ZRiAVg==" -> "different hash"
!~      generation          = 1753403633071702 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
!~      md5hash             = "hpbmvkOQUTAs6tg4ZRiAVg==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ij73Nw==" -> (known after apply)
!~      detect_md5hash      = "tNLVQGl2WM335kK5DNLuyQ==" -> "different hash"
!~      generation          = 1753403633059940 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
!~      md5hash             = "tNLVQGl2WM335kK5DNLuyQ==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_service_alerts_messages_unnested.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "sfrGYw==" -> (known after apply)
!~      detect_md5hash      = "xCwR3YlTLVwAMotyk5DX4g==" -> "different hash"
!~      generation          = 1753403633945119 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
!~      md5hash             = "xCwR3YlTLVwAMotyk5DX4g==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5ou0YA==" -> (known after apply)
!~      detect_md5hash      = "9wxIDNgZNMLnOqGDk+ID5A==" -> "different hash"
!~      generation          = 1752161965978792 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"
!~      md5hash             = "9wxIDNgZNMLnOqGDk+ID5A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/metabase/.DS_Store"] will be destroyed
  # (because key ["models/metabase/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "EMEJ8Q==" -> null
-       detect_md5hash      = "aDkOWxvoLf4RXlTSsN5FVA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1753403633054122 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/metabase/.DS_Store" -> null
-       md5hash             = "aDkOWxvoLf4RXlTSsN5FVA==" -> null
-       md5hexhash          = "68390e5b1be82dfe115e54d2b0de4554" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmetabase%2F.DS_Store?generation=1753403633054122&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/metabase/.DS_Store" -> null
-       output_name         = "data/warehouse/models/metabase/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmetabase%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/metabase/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "mBB5KQ==" -> (known after apply)
!~      detect_md5hash      = "KCesbbSqtO7PwkhMZX2tXg==" -> "different hash"
!~      generation          = 1753403634652772 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
!~      md5hash             = "KCesbbSqtO7PwkhMZX2tXg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "1P0FGg==" -> (known after apply)
!~      detect_md5hash      = "5pGueCChIH71U3b/Vh3FqQ==" -> "different hash"
!~      generation          = 1753403633959903 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
!~      md5hash             = "5pGueCChIH71U3b/Vh3FqQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "RPmKBw==" -> (known after apply)
!~      detect_md5hash      = "nrdBPMlP5jL9xirJR8jsGg==" -> "different hash"
!~      generation          = 1753403633963683 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
!~      md5hash             = "nrdBPMlP5jL9xirJR8jsGg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["tests/.DS_Store"] will be destroyed
  # (because key ["tests/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "s+mJiQ==" -> null
-       detect_md5hash      = "oKfMIt6AQAIL99uaN6y/2Q==" -> null
-       event_based_hold    = false -> null
-       generation          = 1753403633779478 -> null
-       id                  = "calitp-staging-composer-data/warehouse/tests/.DS_Store" -> null
-       md5hash             = "oKfMIt6AQAIL99uaN6y/2Q==" -> null
-       md5hexhash          = "a0a7cc22de8040020bf7db9a37acbfd9" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftests%2F.DS_Store?generation=1753403633779478&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/tests/.DS_Store" -> null
-       output_name         = "data/warehouse/tests/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftests%2F.DS_Store" -> null
-       source              = "../../../../warehouse/tests/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Ju1Uqw==" -> (known after apply)
!~      detect_md5hash      = "KjaiNP/aHm0I1REtZTaNXA==" -> "different hash"
!~      generation          = 1753403635122654 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "KjaiNP/aHm0I1REtZTaNXA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 9 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #396](https://github.com/cal-itp/data-infra/actions/runs/16534036726)